app/views/directors/edit.html.erb

        <%= f.label :category_id, 'Gênero favorito:', class: "input-group-text fw-bold w-25", id: "inputGroup-sizing-lg" %>
        <%= f.collection_select :category_id, Category.all, :id, :name, {}, class: "form-control" %>
---
SELECT "categories".* FROM "categories"