app/views/directors/show.html.erb


        <%@director.film.each do |film | %>
---
SELECT "films".* FROM "films" WHERE "films"."director_id" = ?  [["director_id", 2]]