app/views/films/_form.html.erb

SELECT "categories".* FROM "categories"
---
   <%= f.label 'Gênero: '%>
   <%= f.collection_select :category_id, Category.all, :id, :name %><br>

SELECT "directors".* FROM "directors"
---
   <%= f.label 'Diretor: '%>
   <%= f.collection_select :director_id, Director.all, :id, :name %><br>