app/controllers/categories_controller.rb

    def show
        @category = Category.find(params[:id])
        @films = Film.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "films".* FROM "films"

    def create
        @category = Category.new(params.require(:category).permit(:name))
        if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Ficção Científica"], ["created_at", "2023-03-30 14:11:37.193023"], ["updated_at", "2023-03-30 14:11:37.193023"]]