app/controllers/directors_controller.rb

    def create
        @director = Director.new(params.require(:director).permit(:name, :nationality, :birth_year, :category_id))
        if @director.save
---
INSERT INTO "directors" ("name", "nationality", "birth_year", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "George Lucas"], ["nationality", "Estados Unidos"], ["birth_year", 1960], ["category_id", 4], ["created_at", "2023-03-29 16:58:57.054082"], ["updated_at", "2023-03-29 16:58:57.054082"]]

    def show
        @director = Director.find(params[:id])
        @films = Film.all
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "films".* FROM "films" WHERE "films"."director_id" = ?  [["director_id", 2]]

    def edit
        @director = Director.find(params[:id])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def update
        @director = Director.find(params[:id])
        if @director.update(params.require(:director).permit(:name, :nationality, :birth_year, :category_id))
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "directors" SET "name" = ?, "updated_at" = ? WHERE "directors"."id" = ?  [["name", "Adrian Molina e Lee Unkrich"], ["updated_at", "2023-03-30 17:11:46.921688"], ["id", 5]]