app/controllers/directors_controller.rb

SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @directors = Director.all
        @director = Director.find(params[:id])
        @films = Film.all
        @film = Film.find(params[:id])

SELECT "directors".* FROM "directors"
---
    def new
        @director = Director.new
        @directors = Director.all