app/controllers/films_controller.rb

    def show
        @film = Film.find(params[:id])
        @films = Film.all
---
SELECT "films".* FROM "films"

    def create

        if params[:film][:image]
            img = params[:film][:image].read
            encoded_img = Base64.encode64(img)
        else
            encoded_img = nil
        end

        @film = Film.new(name:        params[:film][:name],
                         year:        params[:film][:year],
                         category_id: params[:film][:category_id],
                         director_id: params[:film][:director_id],
                         synopsis:    params[:film][:synopsis],
                         duration:    params[:film][:duration],
                         image:       encoded_img
        )


            if @film.save
---
INSERT INTO "films" ("name", "year", "synopsis", "duration", "created_at", "updated_at", "category_id", "director_id", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)