app/controllers/films_controller.rb

UPDATE "films" SET "updated_at" = ?, "status" = ? WHERE "films"."id" = ?  [["updated_at", "2023-03-29 22:04:58.192480"], ["status", 0], ["id", 1]]
---
    def update
        @film = Film.find(params[:id])

        if @film.update(name:        params[:film][:name],
                       year:        params[:film][:year],
                       category_id: params[:film][:category_id],
                       synopsis:    params[:film][:synopsis],
                       duration:    params[:film][:duration])