app/controllers/films_controller.rb

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @film = Film.find(params[:id])

INSERT INTO "films" ("title", "year", "synopsis", "country", "duration", "director_id", "category_id", "created_at", "updated_at", "status", "cast", "rating") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @film = Film.new(params.require(:film).permit(:title, :year, :synopsis, :country, :duration, :director_id, :category_id, :status, :image, :cast, :rating))
        if @film.save

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @film = Film.find(params[:id])

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "films" SET "synopsis" = ?, "duration" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["synopsis", "Agora sim uma sinopse"], ["duration", 345], ["updated_at", "2023-03-29 13:22:21.189948"], ["id", 1]]
---
    def update
        @film = Film.find(params[:id])
        if @film.update(params.require(:film).permit(:title, :year, :synopsis, :country, :duration, :director_id, :category_id, :status, :image, :cast, :rating))

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def publish
        film = Film.find(params[:id])

SELECT "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def unpublish
        film = Film.find(params[:id])