app/views/categories/show.html.erb

SELECT "categories".* FROM "categories"
---

            <% @films.select { |film| film.category_id == @category.id }.each do |film| %>